Tekla.Structures.Model.RebarCranking.CrankingTypeEnum
The cranking type.

Tekla.Structures.Model.RebarCranking.CrankingTypeEnum.CUSTOM_CRANKING
Custom cranking.

Tekla.Structures.Model.RebarCranking.CrankingTypeEnum.STANDARD_CRANKING
Standard cranking.